artillery/test_cache_local/upload_shorts.txt
Test run id: t76fh_r8zenq6jgkm9hn3nb6cjq39h4nmha_4mww
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 21:11:15(+0000)

Ramona.Davis+2b960e16-8859-41de-be61-2d8c6b0bc534?token=1733692276805-E60A21D1893A1F1910999A0C1B15FE71
Darby18+bb710e50-cfc3-4d95-85e0-e85333671793?token=1733692277794-2832F9D3D00319F70F7D00BE58550EF9
Fletcher.Berge27+2656041c-522a-4f83-962a-bb3c14d4944d?token=1733692278794-864BDF3DF446C5523FFE467F9F578115
Verdie.Dicki+23650a44-ad62-4192-b1e0-525dd676ecb0?token=1733692278853-D4DF1F7A87A1F738E528166423FDF143
Cole32+6f57b90a-4f8e-41da-a6c5-69d8d5cf98d8?token=1733692279794-37890BC6A1325A326FB776481CAC89F5
Yessenia_Murphy90+fcef4c97-ff8d-4757-bc0e-a05e8bce9762?token=1733692279842-9EFC4F553D3510DEC23A965BA3CF75F1
Lincoln_Lesch69+6e563131-4f58-45e9-bfa5-7244c399320e?token=1733692280795-B7E0A42B70F5222FABD77913FA240419
John.Koelpin82+36a8ac6b-173b-4c08-b9d9-fdd7161b3a7c?token=1733692280843-E5D82A5B1FFEB304CC454C1CCF562196
Terrell_Beier+7a356f00-b6b5-49af-b427-76c04251e67f?token=1733692280905-D34CA4D268E035A980151CD8C2DDB18F
Zachary71+51b72c62-df5c-4cd2-b116-28231d77b6d9?token=1733692281795-F70EC2BE2E22C9746CD3752C2F22B398
Devin.Little+fbd9b18a-e5d3-4c93-99c7-692cfa36dd5b?token=1733692281843-E00915CC0BAE0460A8D767F32064C289
Braeden.Ward42+c8643b16-f27a-4864-87d3-bc575cb39efa?token=1733692281893-89AF9B57829D8A37186A36B73AAE15
Elsie42+6439c80b-2727-4d48-815d-22caa5863561?token=1733692282797-2220FB09989A3463C3A741BCEE794DB0
Cade.Robel87+6345d255-ef86-4cde-91da-400f45d7d35d?token=1733692282844-B89171C280C211997B25234302A7E082
Nikita_Lakin44+4b759074-54f9-460c-9e9d-283883af4ec9?token=1733692282894-B123B5E9A6ACAB65D966C681345688D6
Donny_Farrell20+e5431ed3-2c0e-4896-b3ae-04699db546e3?token=1733692282956-DAD7FD8DC543C40DBC44AA7D018CF0BF
Jacinthe_Dare17+78b7672b-705b-4be6-9de2-bd29e8efcf0f?token=1733692283796-82BE99BF164BC7A2179CD2BE28199E48
Philip.Nienow+690b9db8-b4f4-44aa-bb60-d879c8edab2b?token=1733692283844-25A4322A527DAE359BE6F7FC05CA647E
Marcel.Skiles+effc080f-1793-48b6-958f-0f349aaab2bf?token=1733692283894-F6E3B96159FDA12B323340D15F0084D2
Marques.Gleichner+3eb722c5-dd08-408b-a48f-dd4ff0bfb3ab?token=1733692283943-F7145108D6E8FA201A778ED6DA6F40E8
Devin.Jones+ff0c601a-f668-4fc7-ad22-5729d4ee6ec7?token=1733692284797-E275FB2E546A06DD3F77205F7B59288F
Juana.Gottlieb+54c86f09-8ab5-473a-be37-e004677ec966?token=1733692284843-B911EF1954B214528A97BCFD6F967AFF
Bryon81+c78655ab-b146-445b-9980-f82e0283681a?token=1733692284894-C5DD5E978412A5559EBBC1FF998A95DA
Sarina_Hartmann96+4b3f0700-037e-4017-be05-fcfd89fcabf0?token=1733692284943-7CABA142CBB089994979285303C3506B
Gianni_Witting+98dd1b67-1c6a-4621-a46f-af734d1acadb?token=1733692285004-765C3735BDEC45E727C66945FE806030
Phase completed: Warm up (index: 0, duration: 10s) 21:11:25(+0000)

Michale31+4edb2c6a-f0c6-4034-8911-b2a36ceb47d7?token=1733692285797-5E26D8CD9FB766494CAE80A0732A18B
Delphine.Abshire+af8e3d43-acfe-4abd-ac4d-86efa9662881?token=1733692285843-3C891FDE5233EAF4F20B13EC180DB30C
Sydnie_Bernier+38c4b7b6-085e-4cf4-ac24-16d9f2469934?token=1733692285894-D8B1AF048E4EB5C830620ABDD5C298A3
Llewellyn.Schroeder+cab05007-07fe-45a0-af00-aaaa316a6e9c?token=1733692285943-96A90A1796894AAC4CBB69003CFDB551
Kendall_Reilly71+29f958d8-9435-4f87-9327-9df3ecf61061?token=1733692285993-92C0D2B84A77E613A9CC64DACE0C6F7C
--------------------------------------
Metrics for period to: 21:11:20(+0000) (width: 3.057s)
--------------------------------------

http.codes.200: ................................................................ 6
http.codes.204: ................................................................ 6
http.downloaded_bytes: ......................................................... 1650
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 45
  mean: ........................................................................ 9.9
  median: ...................................................................... 3
  p95: ......................................................................... 44.3
  p99: ......................................................................... 44.3
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 45
  mean: ........................................................................ 9.9
  median: ...................................................................... 3
  p95: ......................................................................... 44.3
  p99: ......................................................................... 44.3
http.responses: ................................................................ 12
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 6
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 6
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 45
  mean: ........................................................................ 17.7
  median: ...................................................................... 4
  p95: ......................................................................... 44.3
  p99: ......................................................................... 44.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 2
  max: ......................................................................... 3
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.Upload short: ........................................... 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.2
  max: ......................................................................... 67.1
  mean: ........................................................................ 28.8
  median: ...................................................................... 9.7
  p95: ......................................................................... 49.9
  p99: ......................................................................... 49.9


--------------------------------------
Metrics for period to: 21:11:30(+0000) (width: 5.209s)
--------------------------------------

http.codes.200: ................................................................ 24
http.codes.204: ................................................................ 24
http.downloaded_bytes: ......................................................... 6717
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 48
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 46
  mean: ........................................................................ 11.5
  median: ...................................................................... 2
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 46
  mean: ........................................................................ 11.5
  median: ...................................................................... 2
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
http.responses: ................................................................ 48
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 24
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 24
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 46
  mean: ........................................................................ 21.2
  median: ...................................................................... 5
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 2
  mean: ........................................................................ 1.8
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 24
vusers.created_by_name.Upload short: ........................................... 24
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.4
  max: ......................................................................... 53.2
  mean: ........................................................................ 29.5
  median: ...................................................................... 25.3
  p95: ......................................................................... 51.9
  p99: ......................................................................... 53


All VUs finished. Total time: 11 seconds

--------------------------------
Summary report @ 21:11:28(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 8367
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 46
  mean: ........................................................................ 11.2
  median: ...................................................................... 3
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 46
  mean: ........................................................................ 11.2
  median: ...................................................................... 3
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 30
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 30
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 46
  mean: ........................................................................ 20.5
  median: ...................................................................... 5
  p95: ......................................................................... 45.2
  p99: ......................................................................... 46.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.8
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.2
  max: ......................................................................... 67.1
  mean: ........................................................................ 29.4
  median: ...................................................................... 25.3
  p95: ......................................................................... 53
  p99: ......................................................................... 53